app/views/admin/items/_form.html.erb

        <div style="display: grid; grid-template-columns: repeat(3, 1fr); gap: 10px; background: #1a1a1a; padding: 15px; border-radius: 8px;">
          <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name do |b| %>
---
SELECT "tags".* FROM "tags"