app/controllers/admin/dashboard_controller.rb

  def index
    @orders_count = Order.count
    @total_revenue = Order.where(status: "paid").sum(:total_price)
    @recent_orders = Order.order(created_at: :desc).limit(5)
---
SELECT COUNT(*) FROM "orders"
SELECT SUM("orders"."total_price") FROM "orders" WHERE "orders"."status" = 'paid'
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 5