app/controllers/admin/items_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC
---
  def index
    @items = Item.all.order(created_at: :desc)

UPDATE "items" SET "updated_at" = '2025-12-16 14:04:27.293538' WHERE "items"."id" = '2eba8c8b-fd48-48f7-b2e8-a7393c400930'
---
  def update
    if @item.update(item_params)