app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN ('29664367-af55-4d92-813f-12f794ff47ed', '8d426407-983d-47a8-ac11-e0a2b1593348')
---
  def index
    @orders = Order.includes(:user).all.order(created_at: :desc)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = '1e717a54-14b4-44a3-b962-fa48b3fa3db8' LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" IN ('ceb10b44-6e31-4f98-a1e4-a62cb2caa970', '9b81adff-f6dd-4bfe-a06a-598849a9f6b6')
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = '1e717a54-14b4-44a3-b962-fa48b3fa3db8'
---
  def show
    @order = Order.find(params[:id])
    @order_items = @order.order_items.includes(:item)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = '1e717a54-14b4-44a3-b962-fa48b3fa3db8' LIMIT 1
UPDATE "orders" SET "status" = 'paid', "updated_at" = '2025-12-15 19:03:01.175105' WHERE "orders"."id" = '1e717a54-14b4-44a3-b962-fa48b3fa3db8'
---
  def update
    @order = Order.find(params[:id])
    if @order.update(order_params)