app/views/admin/orders/index.html.erb

            <%= form_with(model: [:admin, order], local: true, method: :patch) do |f| %>
              <%= f.select :status, Order.statuses.keys.map { |s| [s.upcase, s] }, {},
                  { onchange: "this.form.submit()",
                    style: "background: #1a1a1a; color: white; border: 1px solid var(--muted); padding: 5px; border-radius: 4px; cursor: pointer;" } %>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC