app/views/orders/new.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
---
        <div class="space-y-4 max-h-[300px] overflow-y-auto pr-2 custom-scrollbar mb-6">
          <% @cart.cart_items.each do |ci| %>