app/views/orders/show.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = '5e88b3e3-8218-4c64-b656-94c555005cf0'
---
    <div style="margin: 40px 0; border-top: 1px dashed var(--muted); border-bottom: 1px dashed var(--muted); padding: 20px 0;">
      <% @order.order_items.each do |oi| %>