app/views/items/_item.html.erb

         <span class="px-2 py-0.5 bg-stone-800 rounded text-[9px] uppercase tracking-widest text-stone-400 font-black border border-stone-700">
           <%= item.tags.first&.name || "Instrument" %>
---
SELECT "tags".* FROM "tags"