app/views/items/index.html.erb

SELECT "tags".* FROM "tags"
---
      <div style="max-height: 200px; overflow-y: auto; margin-bottom: 20px;">
        <% Tag.all.each do |tag| %>