app/views/items/show.html.erb

SELECT 1 AS one FROM "reviews" WHERE "reviews"."item_id" = '2eba8c8b-fd48-48f7-b2e8-a7393c400930' LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = 'ceb10b44-6e31-4f98-a1e4-a62cb2caa970'
---
    <h3>Відгуки покупців</h3>
    <% if @item.reviews.any? %>
      <% @item.reviews.each do |review| %>