app/views/items/show.html.erb

      <div>
        <% @item.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."item_id" = '7b8f98ab-afa6-4638-bed7-466bba4c5086'

  <div class="reviews-list">
    <% if @item.reviews.any? %>
      <% @item.reviews.order(created_at: :desc).each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = 'ceb10b44-6e31-4f98-a1e4-a62cb2caa970' ORDER BY "reviews"."created_at" DESC
SELECT 1 AS one FROM "reviews" WHERE "reviews"."item_id" = 'c74ffcad-3ea5-4e84-bf0b-5fc064a4ae31' LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = '7b8f98ab-afa6-4638-bed7-466bba4c5086' ORDER BY "reviews"."created_at" DESC

            <div class="review-meta">
              <strong><%= review.user.email.split('@').first %></strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = '8d426407-983d-47a8-ac11-e0a2b1593348' LIMIT 1