app/controllers/carts_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
SELECT "items".* FROM "items" WHERE "items"."id" IN ('c74ffcad-3ea5-4e84-bf0b-5fc064a4ae31', '9b81adff-f6dd-4bfe-a06a-598849a9f6b6')
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' LIMIT 1
SELECT SUM("cart_items"."quantity") FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
---
  def show
    @cart = current_user.cart || current_user.create_cart

    @cart_items = @cart.cart_items.includes(:item)

    @total_price = @cart_items.sum { |ci| ci.quantity * ci.item.price }