app/controllers/cart_items_controller.rb

def create
  @item = Item.find(params[:item_id])
  @cart = current_user.cart || current_user.create_cart

  ActiveRecord::Base.transaction do
    @cart_item = @cart.cart_items.find_or_initialize_by(item_id: @item.id)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045' AND "cart_items"."item_id" = 'c74ffcad-3ea5-4e84-bf0b-5fc064a4ae31' LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" = 'c74ffcad-3ea5-4e84-bf0b-5fc064a4ae31' LIMIT 1
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' LIMIT 1

  def destroy
    @cart_item = current_user.cart.cart_items.find(params[:id])
    @cart_item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = '9b81adff-f6dd-4bfe-a06a-598849a9f6b6' LIMIT 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045' AND "cart_items"."id" = 'ca933eb4-7e04-4bdb-878f-f525db932b64' LIMIT 1
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' LIMIT 1
DELETE FROM "cart_items" WHERE "cart_items"."id" = 'ca933eb4-7e04-4bdb-878f-f525db932b64'

  def update
    @cart_item = current_user.cart.cart_items.find(params[:id])

    # Визначаємо нову кількість на основі натиснутої кнопки
    case params[:operation]
    when "increment"
      @cart_item.quantity += 1
    when "decrement"
      @cart_item.quantity -= 1 if @cart_item.quantity > 1
    end

    if @cart_item.save
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045' AND "cart_items"."id" = 'a4aa943f-32c9-415b-a13a-08c95e06a6c8' LIMIT 1
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' LIMIT 1
UPDATE "cart_items" SET "quantity" = 2, "updated_at" = '2025-12-14 14:27:29.206876' WHERE "cart_items"."id" = 'a4aa943f-32c9-415b-a13a-08c95e06a6c8'