app/controllers/items_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" IN ('cfe230ad-4685-40ba-851c-ca718f55c69f', '455ac21b-f9c6-4de0-bff0-bf097afe3efb', '35ada840-941f-498a-9be1-51062bb6bb65')
SELECT 1 AS one FROM "items" LEFT OUTER JOIN "taggings" ON "taggings"."item_id" = "items"."id" LEFT OUTER JOIN "tags" ON "tags"."id" = "taggings"."tag_id" WHERE "tags"."id" IN ('cfe230ad-4685-40ba-851c-ca718f55c69f') LIMIT 1
SELECT DISTINCT "items".* FROM "items" LEFT OUTER JOIN "taggings" ON "taggings"."item_id" = "items"."id" LEFT OUTER JOIN "tags" ON "tags"."id" = "taggings"."tag_id" WHERE "tags"."id" IN ('cfe230ad-4685-40ba-851c-ca718f55c69f') ORDER BY "items"."created_at" DESC
---
  def index
    @q = Item.ransack(params[:q])
    @items = @q.result(distinct: true).includes(:tags)