app/controllers/orders_controller.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' LIMIT 1
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045' LIMIT 1
---
  def new
    @cart = current_user.cart
    if @cart.cart_items.empty?

INSERT INTO "orders" ("total_price", "status", "user_id", "created_at", "updated_at", "full_name", "phone", "address", "payment_method", "stripe_session_id") VALUES (35850.0, 'pending', '29664367-af55-4d92-813f-12f794ff47ed', '2025-12-15 09:17:53.810445', '2025-12-15 09:17:53.810445', 'Токарєв Сергій Олександрович', '+380665880320', 'Івано-Франківськ, відділення №16', 'card', NULL) RETURNING "id"
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' LIMIT 1
INSERT INTO "order_items" ("order_id", "item_id", "quantity", "price_at_purchase", "created_at", "updated_at") VALUES ('7061ce8b-c836-420a-afdb-766c8b4d75e0', 'c74ffcad-3ea5-4e84-bf0b-5fc064a4ae31', 1, 850.0, '2025-12-15 09:22:29.632958', '2025-12-15 09:22:29.632958') RETURNING "id"
UPDATE "items" SET "quantity" = 14, "updated_at" = '2025-12-15 09:22:29.647696' WHERE "items"."id" = 'c74ffcad-3ea5-4e84-bf0b-5fc064a4ae31'
DELETE FROM "cart_items" WHERE "cart_items"."id" = 'a4aa943f-32c9-415b-a13a-08c95e06a6c8'
---
  def create
    @cart = current_user.cart
    @order = Order.new(order_params)
    @order.user = current_user
    @order.total_price = @cart.total_price

    ActiveRecord::Base.transaction do
      if @order.save
        @cart.cart_items.each do |ci|
          OrderItem.create!(
            order: @order,
            item: ci.item,
            quantity: ci.quantity,
            # price: ci.item.price_at_purchase
          )

          item = ci.item
          new_quantity = item.quantity - ci.quantity

          if new_quantity < 0
            raise ActiveRecord::Rollback, "Недостатньо товару #{item.name} на складі"
          end

          item.update!(quantity: new_quantity)
        end

        @cart.cart_items.destroy_all

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' LIMIT 1
SELECT SUM("cart_items"."quantity") FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
---
def payment
  @order = Order.find(params[:id])
  @cart = current_user.cart
  if @order.nil?
    redirect_to profile_path, alert: "Замовлення не знайдено або ви не маєте до нього доступу."
    return
  end
  if @order.paid?
    redirect_to order_path(@order), notice: "Це замовлення вже оплачено! 🤘"
    return
  end
  # Створюємо сесію Stripe
  @session = Stripe::Checkout::Session.create({
    customer_email: current_user.email,
    payment_method_types: [ "card" ],
    line_items: @cart.cart_items.map do |ci|
      {
        price_data: {
          currency: "uah",
          product_data: { name: ci.item.name },
          unit_amount: (ci.item.price * 100).to_i
        },
        quantity: ci.quantity
      }
    end,
    mode: "payment",
    success_url: confirm_payment_order_url(@order) + "?session_id={CHECKOUT_SESSION_ID}",
    cancel_url: cart_url
  })

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = '08081a59-34a0-460d-a951-ae54da392deb' AND "orders"."id" = '5e88b3e3-8218-4c64-b656-94c555005cf0' LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."id" = '7b8f98ab-afa6-4638-bed7-466bba4c5086' LIMIT 1
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = '5e88b3e3-8218-4c64-b656-94c555005cf0'
---
  def show
    @order = current_user.orders.find(params[:id])
    @order_items = @order.order_items.includes(:item)