app/controllers/profiles_controller.rb

  def show
    @orders = current_user.orders.order(created_at: :desc)
    @reviews = current_user.reviews.includes(:item)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = '29664367-af55-4d92-813f-12f794ff47ed' ORDER BY "orders"."created_at" DESC

  def update
    if @profile.update(profile_params)
---
UPDATE "profiles" SET "first_name" = 'Сергій', "last_name" = 'Токарєв', "phone_number" = '+380665880320', "updated_at" = '2025-12-14 13:43:49.554238' WHERE "profiles"."id" = '45564c2f-ea43-4b8a-9c20-048c09d2f782'