app/models/cart.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
SELECT "items".* FROM "items" WHERE "items"."id" = 'c74ffcad-3ea5-4e84-bf0b-5fc064a4ae31' LIMIT 1
---
  def total_price
    cart_items.sum { |item| item.item.price * item.quantity }