app/views/layouts/application.html.erb

SELECT SUM("cart_items"."quantity") FROM "cart_items" WHERE "cart_items"."cart_id" = '5af55bff-b30e-4c85-a93a-3a65cc3e3045'
---
              <span class="icon">🛒</span>
              <span class="badge"><%= current_cart.cart_items.sum(:quantity) %></span>